yhsong06/taps_hardware/firmware/Core/Inc/stm32_SPI_IIM42652_drv.h
/*
 * stm32IIM42652_drv_ex.h
 *
 *  Created on: Nov 21, 2021
 *      Author: kim yun sik
 */

#ifndef __IIM42652_DRV_H
#define __IIM42652_DRV_H

#ifdef __cplusplus
extern "C" {
#endif

#define IIM_ADDRESS					(0x69U << 1)

#define IIM_Device_ID				(0x6FU)

/* User Bank 0 Register Map */
#define	IIM_REG_DEVICE_CONFIG			(0x11U)
#define IIM_REG_DRIVE_CONFIG			(0x13U)
#define IIM_REG_INT_CONFIG				(0x14U)
#define IIM_REG_FIFO_CONFIG				(0x16U)
#define IIM_REG_TEMP_DATA1_UI			(0x1DU)
#define IIM_REG_TEMP_DATA0_UI			(0x1EU)
#define IIM_REG_ACCEL_DATA_X1_UI		(0x1FU)
#define IIM_REG_ACCEL_DATA_X0_UI		(0x20U)
#define IIM_REG_ACCEL_DATA_Y1_UI		(0x21U)
#define IIM_REG_ACCEL_DATA_Y0_UI		(0x22U)
#define IIM_REG_ACCEL_DATA_Z1_UI		(0x23U)
#define IIM_REG_ACCEL_DATA_Z0_UI		(0x24U)
#define IIM_REG_GYRO_DATA_X1_UI			(0x25U)
#define IIM_REG_GYRO_DATA_X0_UI			(0x26U)
#define IIM_REG_GYRO_DATA_Y1_UI			(0x27U)
#define IIM_REG_GYRO_DATA_Y0_UI			(0x28U)
#define IIM_REG_GYRO_DATA_Z1_UI			(0x29U)
#define IIM_REG_GYRO_DATA_Z0_UI			(0x2AU)
#define IIM_REG_TMST_FSYNCH				(0x2BU)
#define IIM_REG_TMST_FSYNCL				(0x2CU)
#define IIM_REG_INT_STATUS				(0x2DU)
#define IIM_REG_FIFO_COUNTH				(0x2EU)
#define IIM_REG_FIFO_COUNTL				(0x2FU)
#define IIM_REG_FIFO_DATA				(0x30U)
#define IIM_REG_APEX_DATA0				(0x31U)
#define IIM_REG_APEX_DATA1				(0x32U)
#define IIM_REG_APEX_DATA2				(0x33U)
#define IIM_REG_APEX_DATA3				(0x34U)
#define IIM_REG_APEX_DATA4				(0x35U)
#define IIM_REG_APEX_DATA5				(0x36U)
#define IIM_REG_INT_STATUS2				(0x37U)
#define IIM_REG_INT_STATUS3				(0x38U)
#define IIM_REG_SIGNAL_PATH_RESET		(0x4BU)
#define IIM_REG_INTF_CONFIG0			(0x4CU)
#define IIM_REG_INTF_CONFIG1			(0x4DU)
#define IIM_REG_PWR_MGMT0				(0x4EU)
#define IIM_REG_GYRO_CONFIG0			(0x4FU)
#define IIM_REG_ACCEL_CONFIG0			(0x50U)
#define IIM_REG_GYRO_CONFIG1			(0x51U)
#define IIM_REG_GYRO_ACCEL_CONFIG0		(0x52U)
#define IIM_REG_ACCEL_CONFIG1			(0x53U)
#define IIM_REG_TMST_CONFIG				(0x54U)
#define IIM_REG_APEX_CONFIG0			(0x56U)
#define IIM_REG_SMD_CONFIG				(0x57U)
#define IIM_REG_FIFO_CONFIG1			(0x5FU)
#define IIM_REG_FIFO_CONFIG2			(0x60U)
#define IIM_REG_FIFO_CONFIG3			(0x61U)
#define IIM_REG_FSYNC_CONFIG			(0x62U)
#define IIM_REG_INT_CONFIG0				(0x63U)
#define IIM_REG_INT_CONFIG1				(0x64U)
#define IIM_REG_INT_SOURCE0				(0x65U)
#define IIM_REG_INT_SOURCE1				(0x66U)
#define IIM_REG_INT_SOURCE3				(0x68U)
#define IIM_REG_INT_SOURCE4				(0x69U)
#define IIM_REG_FIFO_LOST_PKT0			(0x6CU)
#define IIM_REG_FIFO_LOST_PKT1			(0x6DU)
#define IIM_REG_SELF_TEST_CONFIG		(0x70U)
#define IIM_REG_WHO_AM_I				(0x75U)
#define IIM_REG_REG_BANK_SEL			(0x76U)

/* User Bank 1 Register Map */
#define IIM_REG_SENSOR_CONFIG0			(0x03U)
#define IIM_REG_GYRO_CONFIG_STATIC2		(0x0BU)
#define IIM_REG_GYRO_CONFIG_STATIC3		(0x0CU)
#define IIM_REG_GYRO_CONFIG_STATIC4		(0x0DU)
#define IIM_REG_GYRO_CONFIG_STATIC5		(0x0EU)
#define IIM_REG_GYRO_CONFIG_STATIC6		(0x0FU)
#define IIM_REG_GYRO_CONFIG_STATIC7		(0x10U)
#define IIM_REG_GYRO_CONFIG_STATIC8		(0x11U)
#define IIM_REG_GYRO_CONFIG_STATIC9		(0x12U)
#define IIM_REG_GYRO_CONFIG_STATIC10	(0x13U)
#define IIM_REG_XG_ST_DATA				(0x5FU)
#define IIM_REG_YG_ST_DATA				(0x60U)
#define IIM_REG_ZG_ST_DATA				(0x61U)
#define IIM_REG_TMSTVAL0				(0x62U)
#define IIM_REG_TMSTVAL1				(0x63U)
#define IIM_REG_TMSTVAL2				(0x64U)
#define IIM_REG_INTF_CONFIG4			(0x7AU)
#define IIM_REG_INTF_CONFIG5			(0x7BU)
#define IIM_REG_INTF_CONFIG6			(0x7CU)

/* User Bank 2 Register Map */
#define IIM_REG_ACCEL_CONFIG_STATIC2	(0x03U)
#define IIM_REG_ACCEL_CONFIG_STATIC3	(0x04U)
#define IIM_REG_ACCEL_CONFIG_STATIC4	(0x05U)
#define IIM_REG_XA_ST_DATA				(0x3BU)
#define IIM_REG_YA_ST_DATA				(0x3CU)
#define IIM_REG_ZA_ST_DATA				(0x3DU)

/* User Bank 3 Register Map */
#define IIM_REG_PU_PD_CONFIG1			(0x06U)
#define IIM_REG_PU_PD_CONFIG2			(0x0EU)

/* User Bank 4 Register Map */
#define IIM_REG_FDR_CONFIG				(0x09U)
#define IIM_REG_APEX_CONFIG1			(0x40U)
#define IIM_REG_APEX_CONFIG2			(0x41U)
#define IIM_REG_APEX_CONFIG3			(0x42U)
#define IIM_REG_APEX_CONFIG4			(0x43U)
#define IIM_REG_APEX_CONFIG5			(0x44U)
#define IIM_REG_APEX_CONFIG6			(0x45U)
#define IIM_REG_APEX_CONFIG7			(0x46U)
#define IIM_REG_APEX_CONFIG8			(0x47U)
#define IIM_REG_APEX_CONFIG9			(0x48U)
#define IIM_REG_APEX_CONFIG10			(0x49U)
#define IIM_REG_ACCEL_WOM_X_THR			(0x4AU)
#define IIM_REG_ACCEL_WOM_Y_THR			(0x4BU)
#define IIM_REG_ACCEL_WOM_Z_THR			(0x4CU)
#define IIM_REG_INT_SOURCE6				(0x4DU)
#define IIM_REG_INT_SOURCE7				(0x4EU)
#define IIM_REG_INT_SOURCE8				(0x4FU)
#define IIM_REG_INT_SOURCE9				(0x50U)
#define IIM_REG_INT_SOURCE10			(0x51U)
#define IIM_REG_OFFSET_USER0			(0x77U)
#define IIM_REG_OFFSET_USER1			(0x78U)
#define IIM_REG_OFFSET_USER2			(0x79U)
#define IIM_REG_OFFSET_USER3			(0x7AU)
#define IIM_REG_OFFSET_USER4			(0x7BU)
#define IIM_REG_OFFSET_USER5			(0x7CU)
#define IIM_REG_OFFSET_USER6			(0x7DU)
#define IIM_REG_OFFSET_USER7			(0x7EU)
#define IIM_REG_OFFSET_USER8			(0x7FU)

/* Register field  */
#define IIM_REG_DEVICE_CONFIG_SOFT_RESET_CONFIG_Pos			(0U)
#define IIM_REG_DEVICE_CONFIG_SOFT_RESET_CONFIG_Msk			(1U << IIM_REG_DEVICE_CONFIG_SOFT_RESET_CONFIG_Pos)
#define IIM_REG_DEVICE_CONFIG_SOFT_RESET_CONFIG				(IIM_REG_DEVICE_CONFIG_SOFT_RESET_CONFIG_Msk)


#define IIM_REG_PWR_MGMT0_TEMP_DIS_Pos						(5U)
#define IIM_REG_PWR_MGMT0_TEMP_DIS_Msk						(1U << IIM_REG_PWR_MGMT0_TEMP_DIS_Pos)
#define IIM_REG_PWR_MGMT0_TEMP_DISABLE						IIM_REG_PWR_MGMT0_TEMP_DIS_Msk
#define IIM_REG_PWR_MGMT0_TEMP_ENABLE						(0U << IIM_REG_PWR_MGMT0_TEMP_DIS_Pos)

#define IIM_REG_PWR_MGMT0_IDLE_Pos							(4U)
#define IIM_REG_PWR_MGMT0_IDLE_Msk							(1U << IIM_REG_PWR_MGMT0_IDLE_Pos)
#define IIM_REG_PWR_MGMT0_IDLE								IIM_REG_PWR_MGMT0_IDLE_Msk

#define IIM_REG_PWR_MGMT0_GYRO_MODE_Pos						(2U)
#define IIM_REG_PWR_MGMT0_GYRO_MODE_Msk						(3U << IIM_REG_PWR_MGMT0_GYRO_MODE_Pos)
#define IIM_REG_PWR_MGMT0_GYRO_MODE_OFF						(0U << IIM_REG_PWR_MGMT0_GYRO_MODE_Pos)
#define IIM_REG_PWR_MGMT0_GYRO_MODE_STANDBY					(1U << IIM_REG_PWR_MGMT0_GYRO_MODE_Pos)
#define IIM_REG_PWR_MGMT0_GYRO_MODE_LOWNOISE				IIM_REG_PWR_MGMT0_GYRO_MODE_Msk

#define IIM_REG_PWR_MGMT0_ACCEL_MODE_Pos					(0U)
#define IIM_REG_PWR_MGMT0_ACCEL_MODE_Msk					(3U << IIM_REG_PWR_MGMT0_ACCEL_MODE_Pos)
#define IIM_REG_PWR_MGMT0_ACCEL_MODE_OFF					(0U << IIM_REG_PWR_MGMT0_ACCEL_MODE_Pos)
#define IIM_REG_PWR_MGMT0_ACCEL_MODE_LOWPOWER				(1U << IIM_REG_PWR_MGMT0_ACCEL_MODE_Pos)
#define IIM_REG_PWR_MGMT0_ACCEL_MODE_LOWNOISE				IIM_REG_PWR_MGMT0_ACCEL_MODE_Msk

/* 0x50 ACCEL_CONFIG0 Register Value */
#define IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Pos				(5U)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Msk				(3U <<IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_16G				(0U <<IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_8G				(1U <<IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_4G				(2U <<IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_2G				(3U <<IIM_REG_ACCEL_CONFIG0_ACCEL_FS_SEL_Pos)

#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos					(0U)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Msk					(15U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_32kHz				(1U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_16kHz				(2U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_8kHz				(3U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_4kHz				(4U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_2kHz				(5U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_1kHz				(6U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_200Hz				(7U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_100Hz				(8U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_50Hz				(9U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_25Hz				(10U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_12_5Hz				(11U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_6_25Hz				(12U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_3_125Hz				(13U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_1_5625Hz			(14U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)
#define IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_500Hz				(15U << IIM_REG_ACCEL_CONFIG0_ACCEL_ODR_Pos)

