yhsong06/taps_hardware/firmware/Core/Inc/stm32_SPI_IIM42652_drv.h
/* 0x4F GYRO_CONFIG0 Register Value */
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos				(5U)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Msk				(0U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_2000dps			(0U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_1000dps			(1U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_500dps				(2U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_250dps				(3U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_125dps				(4U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_62_5dps			(5U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_31_25dps			(6U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_15_625dps			(7U << IIM_REG_GYRO_CONFIG0_GYRO_FS_SEL_Pos)

#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos					(0U)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_Msk					(15U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_32kHz					(1U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_16kHz					(2U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_8kHz					(3U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_4kHz					(4U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_2kHz					(5U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_1kHz					(6U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_200Hz					(7U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_100Hz					(8U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_50Hz					(9U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_25Hz					(10U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_12_5Hz				(11U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)
#define IIM_REG_GYRO_CONFIG0_GYRO_ODR_500Hz					(15U << IIM_REG_GYRO_CONFIG0_GYRO_ODR_Pos)

/* 0x54 TMST_CONFIG Register Field */
#define IIM_REG_TMST_CONFIG_Reserved										(1U << 5U)
#define IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Pos					(4U)
#define IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Msk					(1U << IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Disable			(0U << IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Enable			(1U << IIM_REG_TMST_CONFIG_TMST_TO_REGS_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_RES_Pos								(3U)
#define IIM_REG_TMST_CONFIG_TMST_RES_Msk								(1U << IIM_REG_TMST_CONFIG_TMST_RES_Pos)
#define IIM_REG_TMST_CONFIG_TMST_RES_1us								(0U << IIM_REG_TMST_CONFIG_TMST_RES_Pos)
#define IIM_REG_TMST_CONFIG_TMST_RES_16us								(1U << IIM_REG_TMST_CONFIG_TMST_RES_Pos)
#define IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Pos						(2U)
#define IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Msk						(1U << IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Disable				(0U << IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Enable				(1U << IIM_REG_TMST_CONFIG_TMST_DELTA_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Pos						(1U)
#define IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Msk						(1U << IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Disable				(0U << IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Enable				(1U << IIM_REG_TMST_CONFIG_TMST_FSYNC_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_EN_Pos									(0U)
#define IIM_REG_TMST_CONFIG_TMST_EN_Msk									(1U << IIM_REG_TMST_CONFIG_TMST_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_EN_Disable							(0U << IIM_REG_TMST_CONFIG_TMST_EN_Pos)
#define IIM_REG_TMST_CONFIG_TMST_EN_Enable							(1U << IIM_REG_TMST_CONFIG_TMST_EN_Pos)

/* 0x14 INT_CONFIG Register Field */
#define IIM_REG_INT_CONFIG_INT2_MODE_Pos					(5U)
#define IIM_REG_INT_CONFIG_INT2_MODE_Msk					(1U << IIM_REG_INT_CONFIG_INT2_MODE_Pos)
#define IIM_REG_INT_CONFIG_INT2_MODE_Pulsed					(0U << IIM_REG_INT_CONFIG_INT2_MODE_Pos)
#define IIM_REG_INT_CONFIG_INT2_MODE_Latched				(1U << IIM_REG_INT_CONFIG_INT2_MODE_Pos)

#define IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_Pos			(4U)
#define IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_Msk			(1U << IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_Pos)
#define IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_OpenDrain		(0U << IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_Pos)
#define IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_PushPull		(1U << IIM_REG_INT_CONFIG_INT2_DRIVE_CIRCUIT_Pos)

#define IIM_REG_INT_CONFIG_INT2_POLARITY_Pos				(3U)
#define IIM_REG_INT_CONFIG_INT2_POLARITY_Msk				(1U << IIM_REG_INT_CONFIG_INT2_POLARITY_Pos)
#define IIM_REG_INT_CONFIG_INT2_POLARITY_ActiveLow			(0U << IIM_REG_INT_CONFIG_INT2_POLARITY_Pos)
#define IIM_REG_INT_CONFIG_INT2_POLARITY_ActiveHigh			(1U << IIM_REG_INT_CONFIG_INT2_POLARITY_Pos)

#define IIM_REG_INT_CONFIG_INT1_MODE_Pos					(2U)
#define IIM_REG_INT_CONFIG_INT1_MODE_Msk					(1U << IIM_REG_INT_CONFIG_INT1_MODE_Pos)
#define IIM_REG_INT_CONFIG_INT1_MODE_Pulsed					(0U << IIM_REG_INT_CONFIG_INT1_MODE_Pos)
#define IIM_REG_INT_CONFIG_INT1_MODE_Latched				(1U << IIM_REG_INT_CONFIG_INT1_MODE_Pos)

#define IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_Pos			(1U)
#define IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_Msk			(1U << IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_Pos)
#define IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_OpenDrain		(0U << IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_Pos)
#define IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_PushPull		(1U << IIM_REG_INT_CONFIG_INT1_DRIVE_CIRCUIT_Pos)

#define IIM_REG_INT_CONFIG_INT1_POLARITY_Pos				(0U)
#define IIM_REG_INT_CONFIG_INT1_POLARITY_Msk				(1U << IIM_REG_INT_CONFIG_INT1_POLARITY_Pos)
#define IIM_REG_INT_CONFIG_INT1_POLARITY_ActiveLow			(0U << IIM_REG_INT_CONFIG_INT1_POLARITY_Pos)
#define IIM_REG_INT_CONFIG_INT1_POLARITY_ActiveHigh			(1U << IIM_REG_INT_CONFIG_INT1_POLARITY_Pos)

