yhsong06/taps_hardware/firmware/Core/Inc/stm32_SPI_IIM42652_drv.h
/* 0x16 FIFO_CONFIG Register Field */
#define IIM_REG_FIFO_CONFIG_FIFO_MODE_Pos					(6U)
#define IIM_REG_FIFO_CONFIG_FIFO_MODE_Msk					(3U << IIM_REG_FIFO_CONFIG_FIFO_MODE_Pos)
#define IIM_REG_FIFO_CONFIG_FIFO_MODE_Bypass				(0U << IIM_REG_FIFO_CONFIG_FIFO_MODE_Pos)
#define IIM_REG_FIFO_CONFIG_FIFO_MODE_StreamtoFIFO			(1U << IIM_REG_FIFO_CONFIG_FIFO_MODE_Pos)
#define IIM_REG_FIFO_CONFIG_FIFO_MODE_StoponFull			(2U << IIM_REG_FIFO_CONFIG_FIFO_MODE_Pos)

/* 0x2D INT_STATUS Register Field */
#define IIM_REG_INT_STATUS_UI_FSYNC_INT_Pos					(6U)
#define IIM_REG_INT_STATUS_UI_FSYNC_INT_Msk					(1U <<IIM_REG_INT_STATUS_UI_FSYNC_INT_Pos)
#define IIM_REG_INT_STATUS_PLL_RDY_INT_Pos					(5U)
#define IIM_REG_INT_STATUS_PLL_RDY_INT_Msk					(1U << IIM_REG_INT_STATUS_PLL_RDY_INT_Pos)
#define IIM_REG_INT_STATUS_RESET_DONE_INT_Pos				(4U)
#define IIM_REG_INT_STATUS_RESET_DONE_INT_Msk				(1U << IIM_REG_INT_STATUS_RESET_DONE_INT_Pos)
#define IIM_REG_INT_STATUS_DATA_RDY_INT_Pos					(3U)
#define IIM_REG_INT_STATUS_DATA_RDY_INT_Msk					(1U << IIM_REG_INT_STATUS_DATA_RDY_INT_Pos)
#define IIM_REG_INT_STATUS_FIFO_THS_INT_Pos					(2U)
#define IIM_REG_INT_STATUS_FIFO_THS_INT_Msk					(1U << IIM_REG_INT_STATUS_FIFO_THS_INT_Pos)
#define IIM_REG_INT_STATUS_FIFO_FULL_INT_Pos				(1U)
#define IIM_REG_INT_STATUS_FIFO_FULL_INT_Msk				(1U << IIM_REG_INT_STATUS_FIFO_FULL_INT_Pos)
#define IIM_REG_INT_STATUS_AGC_RDY_INT_Pos					(0U)
#define IIM_REG_INT_STATUS_AGC_RDY_INT_Msk					(1U << IIM_REG_INT_STATUS_AGC_RDY_INT_Pos)

/* 0x5F FIFO_CONFIG1 Register Field */
#define IIM_REG_FIFO_CONFIG1_FIFO_RESUME_PARTIAL_RD_Pos		(6U)
#define IIM_REG_FIFO_CONFIG1_FIFO_RESUME_PARTIAL_RD_Msk		(1U << IIM_REG_FIFO_CONFIG1_FIFO_RESUME_PARTIAL_RD_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_RESUME_PARTIAL_RD			(IIM_REG_FIFO_CONFIG1_FIFO_RESUME_PARTIAL_RD_Msk)
#define IIM_REG_FIFO_CONFIG1_FIFO_WM_GT_TH_Pos				(5U)
#define IIM_REG_FIFO_CONFIG1_FIFO_WM_GT_TH_Msk				(1U << IIM_REG_FIFO_CONFIG1_FIFO_WM_GT_TH_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_WM_GT_TH					(IIM_REG_FIFO_CONFIG1_FIFO_WM_GT_TH_Msk)
#define IIM_REG_FIFO_CONFIG1_FIFO_HIRES_EN_Pos				(4U)
#define IIM_REG_FIFO_CONFIG1_FIFO_HIRES_EN_Msk				(1U << IIM_REG_FIFO_CONFIG1_FIFO_HIRES_EN_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_HIRES_EN					(IIM_REG_FIFO_CONFIG1_FIFO_HIRES_EN_Msk)
#define IIM_REG_FIFO_CONFIG1_FIFO_TMST_FSYNC_EN_Pos			(3U)
#define IIM_REG_FIFO_CONFIG1_FIFO_TMST_FSYNC_EN_Msk			(1U << IIM_REG_FIFO_CONFIG1_FIFO_TMST_FSYNC_EN_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_TMST_FSYNC_EN				(IIM_REG_FIFO_CONFIG1_FIFO_TMST_FSYNC_EN_Msk)
#define IIM_REG_FIFO_CONFIG1_FIFO_TEMP_EN_Pos				(2U)
#define IIM_REG_FIFO_CONFIG1_FIFO_TEMP_EN_Msk				(1U << IIM_REG_FIFO_CONFIG1_FIFO_TEMP_EN_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_TEMP_EN					(IIM_REG_FIFO_CONFIG1_FIFO_TEMP_EN_Msk)
#define IIM_REG_FIFO_CONFIG1_FIFO_GYRO_EN_Pos				(1U)
#define IIM_REG_FIFO_CONFIG1_FIFO_GYRO_EN_Msk				(1U << IIM_REG_FIFO_CONFIG1_FIFO_GYRO_EN_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_GYRO_EN					(IIM_REG_FIFO_CONFIG1_FIFO_GYRO_EN_Msk)
#define IIM_REG_FIFO_CONFIG1_FIFO_ACCEL_EN_Pos				(0U)
#define IIM_REG_FIFO_CONFIG1_FIFO_ACCEL_EN_Msk				(1U << IIM_REG_FIFO_CONFIG1_FIFO_ACCEL_EN_Pos)
#define IIM_REG_FIFO_CONFIG1_FIFO_ACCEL_EN					(IIM_REG_FIFO_CONFIG1_FIFO_ACCEL_EN_Msk)

/* 0x62 FSYNC_CONFIG Register Field */
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos				(4U)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Msk				(7U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_NO_TAG			(0U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_TEMP_OUT			(1U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_GYRO_XOUT			(2U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_GYRO_YOUT			(3U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_GYRO_ZOUT			(4U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_ACCEL_XOUT		(5U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_ACCEL_YOUT		(6U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_ACCEL_ZOUT		(7U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_FLAG_CLEAR_SEL_Pos	(1U)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_FLAG_CLEAR_SEL_Msk	(1U << IIM_REG_FSYNC_CONFIG_FSYNC_UI_FLAG_CLEAR_SEL_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_UI_FLAG_CLEAR_SEL		(IIM_REG_FSYNC_CONFIG_FSYNC_UI_FLAG_CLEAR_SEL_Msk)
#define IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_Pos				(0U)
#define IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_Msk				(1U << IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_Pos)
#define IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_FALL			(IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_Msk)
#define IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_RISE			(0U << IIM_REG_FSYNC_CONFIG_FSYNC_POLARITY_Pos)


/* 0x63 INT_CONFIG0 Register Field */
#define IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_Pos				(4U)
#define IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_Msk				(3U << IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_ON_STATUS_READ	(0U << IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_ON_SENSOR_READ	(2U << IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_ON_BOTH_READ		(3U << IIM_REG_INT_CONFIG0_UI_DRDY_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_Pos				(2U)
#define IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_Msk				(3U << IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_ON_STATUS_READ	(0U << IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_ON_FIFO_READ		(2U << IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_ON_BOTH_READ		(3U << IIM_REG_INT_CONFIG0_FIFO_THS_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_Pos				(0U)
#define IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_Msk				(3U << IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_ON_STATUS_READ	(0U << IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_ON_FIFO_READ	(2U << IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_Pos)
#define IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_ON_BOTH_READ	(3U << IIM_REG_INT_CONFIG0_FIFO_FULL_INT_CLEAR_Pos)

/* 0x64 INT_CONFIG1 Register Field */
#define IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_Pos			(6U)
#define IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_Msk			(1U << IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_Pos)
#define IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_100US		(0U << IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_Pos)
#define IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_8US			(1U << IIM_REG_INT_CONFIG1_INT_TPULSE_DURATION_Pos)
#define IIM_REG_INT_CONFIG1_INT_TDEASSERT_DISABLE_Pos		(5U)
#define IIM_REG_INT_CONFIG1_INT_TDEASSERT_DISABLE_Msk		(1U << IIM_REG_INT_CONFIG1_INT_TDEASSERT_DISABLE_Pos)
#define IIM_REG_INT_CONFIG1_INT_TDEASSERT_DISABLE			(IIM_REG_INT_CONFIG1_INT_TDEASSERT_DISABLE_Msk)
#define IIM_REG_INT_CONFIG1_INT_ASYNC_RESET_Pos				(4U)
#define IIM_REG_INT_CONFIG1_INT_ASYNC_RESET_Msk				(1U << IIM_REG_INT_CONFIG1_INT_ASYNC_RESET_Pos)
#define IIM_REG_INT_CONFIG1_INT_ASYNC_RESET					(IIM_REG_INT_CONFIG1_INT_ASYNC_RESET_Msk)

/* 0x65 INT_SOURCE0 Register Field */
#define IIM_REG_INT_SOURCE0_UI_FSYNC_INT1_EN_Pos			(6U)
#define IIM_REG_INT_SOURCE0_UI_FSYNC_INT1_EN_Msk			(1U << IIM_REG_INT_SOURCE0_UI_FSYNC_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_UI_FSYNC_INT1_EN				(IIM_REG_INT_SOURCE0_UI_FSYNC_INT1_EN_Msk)
#define IIM_REG_INT_SOURCE0_PLL_RDY_INT1_EN_Pos				(5U)
#define IIM_REG_INT_SOURCE0_PLL_RDY_INT1_EN_Msk				(1U << IIM_REG_INT_SOURCE0_PLL_RDY_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_PLL_RDY_INT1_EN					(IIM_REG_INT_SOURCE0_PLL_RDY_INT1_EN_Msk)
#define IIM_REG_INT_SOURCE0_RESET_DONE_INT1_EN_Pos			(4U)
#define IIM_REG_INT_SOURCE0_RESET_DONE_INT1_EN_Msk			(1U << IIM_REG_INT_SOURCE0_RESET_DONE_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_RESET_DONE_INT1_EN				(IIM_REG_INT_SOURCE0_RESET_DONE_INT1_EN_Msk)
#define IIM_REG_INT_SOURCE0_UI_DRDY_INT1_EN_Pos				(3U)
#define IIM_REG_INT_SOURCE0_UI_DRDY_INT1_EN_Msk				(1U << IIM_REG_INT_SOURCE0_UI_DRDY_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_UI_DRDY_INT1_EN					(IIM_REG_INT_SOURCE0_UI_DRDY_INT1_EN_Msk)
#define IIM_REG_INT_SOURCE0_FIFO_THS_INT1_EN_Pos			(2U)
#define IIM_REG_INT_SOURCE0_FIFO_THS_INT1_EN_Msk			(1U << IIM_REG_INT_SOURCE0_FIFO_THS_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_FIFO_THS_INT1_EN				(IIM_REG_INT_SOURCE0_FIFO_THS_INT1_EN_Msk)
#define IIM_REG_INT_SOURCE0_FIFO_FULL_INT1_EN_Pos			(1U)
#define IIM_REG_INT_SOURCE0_FIFO_FULL_INT1_EN_Msk			(1U << IIM_REG_INT_SOURCE0_FIFO_FULL_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_FIFO_FULL_INT1_EN				(IIM_REG_INT_SOURCE0_FIFO_FULL_INT1_EN_Msk)
#define IIM_REG_INT_SOURCE0_UI_AGC_RDY_INT1_EN_Pos			(0U)
#define IIM_REG_INT_SOURCE0_UI_AGC_RDY_INT1_EN_Msk			(1U << IIM_REG_INT_SOURCE0_UI_AGC_RDY_INT1_EN_Pos)
#define IIM_REG_INT_SOURCE0_UI_AGC_RDY_INT1_EN				(IIM_REG_INT_SOURCE0_UI_AGC_RDY_INT1_EN_Msk)

/* 0x68 INT_SOURCE3 Register Field */
#define IIM_REG_INT_SOURCE3_UI_FSYNC_INT2_EN_Pos			(6U)
#define IIM_REG_INT_SOURCE3_UI_FSYNC_INT2_EN_Msk			(1U << IIM_REG_INT_SOURCE3_UI_FSYNC_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_UI_FSYNC_INT2_EN				(IIM_REG_INT_SOURCE3_UI_FSYNC_INT2_EN_Msk)
#define IIM_REG_INT_SOURCE3_PLL_RDY_INT2_EN_Pos				(5U)
#define IIM_REG_INT_SOURCE3_PLL_RDY_INT2_EN_Msk				(1U << IIM_REG_INT_SOURCE3_PLL_RDY_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_PLL_RDY_INT2_EN					(IIM_REG_INT_SOURCE3_PLL_RDY_INT2_EN_Msk)
#define IIM_REG_INT_SOURCE3_RESET_DONE_INT2_EN_Pos			(4U)
#define IIM_REG_INT_SOURCE3_RESET_DONE_INT2_EN_Msk			(1U << IIM_REG_INT_SOURCE3_RESET_DONE_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_RESET_DONE_INT2_EN				(IIM_REG_INT_SOURCE3_RESET_DONE_INT2_EN_Msk)
#define IIM_REG_INT_SOURCE3_UI_DRDY_INT2_EN_Pos				(3U)
#define IIM_REG_INT_SOURCE3_UI_DRDY_INT2_EN_Msk				(1U << IIM_REG_INT_SOURCE3_UI_DRDY_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_UI_DRDY_INT2_EN					(IIM_REG_INT_SOURCE3_UI_DRDY_INT2_EN_Msk)
#define IIM_REG_INT_SOURCE3_FIFO_THS_INT2_EN_Pos			(2U)
#define IIM_REG_INT_SOURCE3_FIFO_THS_INT2_EN_Msk			(1U << IIM_REG_INT_SOURCE3_FIFO_THS_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_FIFO_THS_INT2_EN				(IIM_REG_INT_SOURCE3_FIFO_THS_INT2_EN_Msk)
#define IIM_REG_INT_SOURCE3_FIFO_FULL_INT2_EN_Pos			(1U)
#define IIM_REG_INT_SOURCE3_FIFO_FULL_INT2_EN_Msk			(1U << IIM_REG_INT_SOURCE3_FIFO_FULL_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_FIFO_FULL_INT2_EN				(IIM_REG_INT_SOURCE3_FIFO_FULL_INT2_EN_Msk)
#define IIM_REG_INT_SOURCE3_UI_AGC_RDY_INT2_EN_Pos			(0U)
#define IIM_REG_INT_SOURCE3_UI_AGC_RDY_INT2_EN_Msk			(1U << IIM_REG_INT_SOURCE3_UI_AGC_RDY_INT2_EN_Pos)
#define IIM_REG_INT_SOURCE3_UI_AGC_RDY_INT2_EN				(IIM_REG_INT_SOURCE3_UI_AGC_RDY_INT2_EN_Msk)

/* 0x70 SELF_TEST_CONFIG Register Field */
#define IIM_REG_SELF_TEST_CONFIG_ACCEL_ST_POWER_Pos			(6U)
#define IIM_REG_SELF_TEST_CONFIG_ACCEL_ST_POWER_Msk			(1U << IIM_REG_SELF_TEST_CONFIG_ACCEL_ST_POWER_Pos)
#define IIM_REG_SELF_TEST_CONFIG_ACCEL_ST_POWER				(IIM_REG_SELF_TEST_CONFIG_ACCEL_ST_POWER_Msk)
#define IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_Pos			(3U)
#define IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_Msk			(7U << IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_Pos)
#define IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_ENABLE			(IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_Msk)
#define IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_DISABLE		(0U << IIM_REG_SELF_TEST_CONFIG_EN_ACCEL_ST_Pos)
#define IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_Pos				(0U)
#define IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_Msk				(7U << IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_Pos)
#define IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_ENABLE			(IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_Msk)
#define IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_DISABLE			(0U << IIM_REG_SELF_TEST_CONFIG_EN_GYRO_ST_Pos)








#ifdef __cplusplus
}
#endif

#endif /* __IIM42652_DRV_H */
